tests/integration/scripts/12.single.controller.all.yml
script:
  config:
    target: 'https://example.com'
    phases:
      - duration: 10
        arrivalRate: 1
        rampTo: 5
      - duration: 10
        arrivalRate: 5
      - duration: 10
        arrivalRate: 5
        rampTo: 1
  scenarios:
    - flow:
      - get:
          url: '/'
expectations:
  - from: 0
    to: 10
    min: 20
    max: 40
  - from: 10
    to: 20
    min: 40
    max: 60
  - from: 20
    to: 30
    min: 20
    max: 40