tests/integration/scripts/4.single.worker.all.yml
script:
  config:
    target: 'https://example.com'
    phases:
      - duration: 10
        arrivalRate: 1
        rampTo: 10
        name: 'Single worker - ramp up'
      - duration: 10
        arrivalRate: 10
        name: 'Single worker - sustain'
      - duration: 10
        arrivalRate: 10
        rampTo: 1
        name: 'Single worker - ramp down'
  scenarios:
    - flow:
      - get:
          url: '/'
expectations:
  - from: 0
    to: 10
    min: 45
    max: 65
  - from: 10
    to: 20
    min: 90
    max: 110
  - from: 20
    to: 30
    min: 45
    max: 65