tests/integration/scripts/multiple.worker.all.yml
script:
  _split:
    maxChunkRequestsPerSecond: 20
  config:
    target: 'https://example.com'
    phases:
      - duration: 30
        arrivalRate: 1
        rampTo: 15
      - duration: 30
        arrivalRate: 15
  scenarios:
    - flow:
      - get:
          url: '/'
expectations:
  - from: 0
    to: 30
    min: 250
    max: 310
  - from: 30
    to: 60
    min: 385
    max: 460